print('вы играли когда-нибудь игры?\n 1)да 2)нет') #0
a=int(input('ответ:'))

if a==1:
    b=int(input('вы что больше предпочитаете? \n 1)Шутеры 2)РПГ 3)Вышивание 4)Тактические 5)одиночные \n ответ: ')) #1

    c=int(input('как вы в основном играете? \n 1)агресивно 2)пасивно 3)смотря по ситуации \n ответ: ')) #2

    d=int(input('вы когда-нибудь злились в онлайн играх? \n 1)да 2)нет \n ответ: ')) #3

    e=int(input('вас когда-нибудь оскорбляли в играх? \n 1)да 2)нет \n ответ: ')) #4

    r=int(input('вы когда-нибудь выходили из игры когда не идет игра? \n 1)да 2)нет \n ответ: ')) #5

    t=int(input('вы когда-нибудь были в потоке (полная сосредаточеность)? \n 1)да 2)нет \n ответ: ')) #6

    y=int(input('вы как играете? \n 1)один 2)с друзьями 3)с рандомами \n ответ: ')) #7

    u=int(input('вы как играете когда против вас слабые противники? \n 1)на полную 2)на раслабоне 3)просто так играю \n ответ: ')) #8